{
  "logo": "</S.R>",
  "aboutMe": "About Me",
  "myExperience": "My Experience",
  "skills": "Skills",
  "contacts": "Contacts",
  "articles": "Articles",
  "jobTitle": "Senior Frontend Developer",
  "hiMsg": "Hi, I'm Stan. Nice to meet you!",
  "downloadResume": "Download Resume",
  "planetaKino": "PlanetaKino",
  "date1": "January 2022 - Present",
  "date2": "August 2021 – January 2022",
  "date3": "May 2021 – July 2021",
  "date4": "August 2020 – May 2021",
  "position": "Lead Front-end Developer",
  "desc1": "Developed administrative panels, websites, and cashier workstation systems (ARM). Mentored frontend developers, reviewed merge requests (MR), and created complex components and modules. Participated in project architecture design and implementation. Improved frontend performance to meet high PageSpeed metrics and web performance standards. Built cross-platform desktop applications using Electron, integrating web technologies with native capabilities. SEO optimization.",
  "techStack": "Technologies",
  "frontEndDeveloper": "Frontend Developer",
  "vJetGroup": "v-jet group",
  "desc2": "Developed client applications for international clients: Admin panel for the 'Choice' restaurant chain. Admin panel and website for a Polish furniture factory (B2B and B2C). Admin panel for an advertising company managing over 1000 tablets across Ukraine. Led projects from inception to completion: designed architecture, implemented core modules, and focused on performance optimization and maintainability.",
  "quartSoft": "QuartSoft",
  "desc3": "Developed a cartography service for Ukraine. Worked on systems for handling cadastral and registry data. Built both desktop and mobile platform versions with emphasis on performance and usability.",
  "foxprimeTv": "FOXPRIME.tv",
  "desc4": "Developed a streaming service: admin panel and public website. Designed system architecture, implemented SEO and performance optimization. Enabled streaming of TV channels, movies, and radio. Integrated payment systems and recurring billing. Refactored BootstrapVue components into clean, extensible custom components.",
  "article1": "Implementing JWT Token Management Service Using Axios and Vue.js",
  "article2": "Vue Mixins: Magic or Boilerplate?",
  "article3": "Introduction to JavaScript: Proxy vs Object.defineProperty",
  "article4": "Why OOP and SOLID Matter in JavaScript World?",
  "writeMeMessage": "If my experience interests you or you have a proposal for technical collaboration or just an interesting discussion—I'd be happy to connect. Open to new acquaintances and good people.",
  "footerText": "© 2025 Stanislav Radchenko",
  "heroTitle": "Frontend Developer focused on complex business applications.",
  "heroDesc1": "I build high-load client-administrative systems that help businesses scale while ensuring seamless user experience. Skilled at finding the balance between clean architecture, elegant code, and real product needs. Fully immerse myself in products,",
  "heroDesc2": "aiming not just to 'deliver' but to deliver well—bringing value to both the product and the team.",
  "heroDesc3": "For me, every line of code carries user responsibility. Extensive experience working",
  "withVueAndNuxt": "with Vue and Nuxt.",
  "goodProgrammerMsg": "A programmer isn't just someone who writes code. It's someone who solves problems.",
  "cardDesc1": "I'm a developer with extensive experience building",
  "spaSsrApps": "SPA and SSR applications.",
  "cardDesc2": "Have commercial experience with",
  "cardDesc3": "Developed both complex",
  "thatAnd": "and",
  "clients": "client",
  "sites": "sites",
  "cardDesc4": "Have experience in",
  "techLeading": "technical leadership:",
  "cardDesc5": "maintained code quality standards in teams, conducted reviews",
  "cardDesc6": "and kept codebase at high standards.",
  "worWithElectron": "Worked with Electron:",
  "integration": "integrated",
  "cardDesc7": "terminals and receipt printers, implemented fiscal registrar (RRO) support for POS systems. Performed",
  "optimizations": "performance optimizations",
  "cardDesc8": "to meet Google Performance requirements, improved interface loading speed and responsiveness.",
  "cardDesc9": "Attention to detail, structured code and thoughtful solutions form the foundation of",
  "goodProduct": "quality products",
  "workFor": "that serve both",
  "cardProduct10": "users and business needs.",
  "cardDesc10": "Attention to detail, structured code, and thoughtful solutions are the foundation",
  "cardProduct11": "delivering value to both users and businesses.",
  "adminPanel": "admin panel",
  "metaName": "Stanislav Radchenko",
  "resume": "Resume",
  "metaDesc": "Frontend-reseller, focused on folding business add-ons.\nI create highly innovative client-administrative systems that help businesses scale up and help traders to operate without hesitation."
}