{
  "logo": "Sten Ready",
  "aboutMe": "Про мене",
  "myExperience": "Мій досвід",
  "skills": "Навички",
  "contacts": "Контакти",
  "articles": "Статті",
  "jobTitle": "Senior Frontend Developer",
  "hiMsg": "Привіт, я Стас. Радий знайомству!",
  "downloadResume": "Завантажити резюме",
  "planetaKino": "PlanetaKino",
  "date1": "Січень 2022 р. - Нині",
  "date2": "Серпень 2021 р. – січень 2022 р.",
  "date3": "Травень 2021 р. – Липень 2021 р.",
  "date4": "Серпень 2020 р. – травень 2021 р.",
  "position": "Lead Front-end developer",
  "desc1": "Розробляв адміністративні панелі, веб-сайти та системи робочих станцій касирів (ARM). Наставляв розробників фронтенду, переглядав запити на злиття (MR) та створював складні  компоненти та модулі. Брав участь у розробці та впровадженні архітектури проекту. Покращував продуктивність фронтенду для відповідності високим показникам PageSpeed ​​та стандартам веб-продуктивності. Створював кросплатформні настільні додатки, використовуючи Electron, інтегруючи веб-технології з нативними можливостями. SEO.",
  "techStack": "Технології",
  "frontEndDeveloper": "Frontend Developer",
  "vJetGroup": "v-jet group",
  "desc2": "Розробляв клієнтські додатки для міжнародних клієнтів: Адмінпанель для мережі ресторанів «Choice» Адмінпанель та вебсайт для польської меблевої фабрики (B2B та B2C) Адмінпанель для рекламної компанії, яка керує понад 1000 планшетами по всій Україні Керівництво проектами від початку до кінця: розробляв архітектуру, впроваджував ключові модулі та зосереджувався на оптимізації продуктивності та зручності обслуговування.",
  "quartSoft": "QuartSoft/КвартСофт",
  "desc3": "Розробив картографічний сервіс для України. Працював над системами для обробки кадастрових та реєстрових даних. Створив як настільну, так і мобільну версії платформи з акцентом на продуктивність та зручність використання.",
  "foxprimeTv": "FOXPRIME.tv",
  "desc4": "Розроблено сервіс потокового передавання: адміністративна панель та публічний веб-сайт.Роботою розроблено архітектуру системи, SEO та оптимізацію продуктивності.Реалізовано потокове передавання телеканалів, фільмів та радіо.Інтегровано системи платежів та періодичного виставлення рахунків.Рефакторовано компоненти BootstrapVue у чисті, розширювані користувацькі компоненти.",
  "article1": "Реалізація сервісу для управління JWT-токенами з використанням Axios та Vue.js",
  "article2": "Vue Mixins Магія чи банальщина?",
  "article3": "Введення в JavaScript: Proxy vs Object.defineProperty",
  "article4": "Почему ООП и SOLID важны в мире JavaScript?",
  "writeMeMessage": "Якщо вас зацікавив мій досвід або маєте пропозицію для технічної співпраці чи просто цікаве обговорення — буду радий поспілкуватися. Відкритий до нових знайомств і хороших людей.",
  "footerText": "© 2025 Радченко Станіслав",
  "heroTitle": " Frontend-розробник, зосереджений на складних бізнес-додатках.",
  "heroDesc1": "Я створюю високонавантажені клієнтсько-адміністративні системи, які допомагають бізнесу масштабуватись, а користувачам — працювати без зайвого тертя. Умію знаходити баланс між чистою архітектурою, елегантним кодом і реальними потребами продукту. Завжди повністю занурююся в продукт,",
  "heroDesc2": "прагнучи не просто «зробити», а зробити добре — принести цінність і продукту, і команді.",
  "heroDesc3": "Для мене кожен рядок коду — це відповідальність перед користувачем. Маю великий досвід роботи",
  "withVueAndNuxt": "з Vue та Nuxt.",
  "goodProgrammerMsg": "Програміст — це не просто той, хто пише код. Це той, хто розв’язує проблеми.",
  "cardDesc1": "Я розробник із великим досвідом написання",
  "spaSsrApps": "SPA, SSR додатків.",
  "cardDesc2": "Маю комерційний досвід із",
  "cardDesc3": "Розробляв як складні",
  "thatAnd": "так і",
  "clients": "клієнтські",
  "sites": "сайти",
  "cardDesc4": "Маю досвід",
  "techLeading": "технічного лідерства:",
  "cardDesc5": "відповідав за якість коду в команді, здійснював рев’ю",
  "cardDesc6": "та підтримував кодову базу на високому рівні.",
  "worWithElectron": "Працював із Electron:",
  "integration": "інтегрував",
  "cardDesc7": "термінали та принтери для друку чеків, реалізовував підтримку ПРРО",
  "cardDesc8": "(програмних РРО) кас. Займався",
  "optimizations": "оптимізацією",
  "cardDesc9": "продуктивності під вимоги Google Performance, покращував швидкість завантаження й відгуку інтерфейсу.",
  "cardDesc10": "Уважність до деталей, структурований код і продумані рішення — основа",
  "goodProduct": "якісного продукту",
  "workFor": ", який працює на",
  "cardProduct11": "користь як для користувачів, так і для бізнесу.",
  "adminPanel": "адмін-панелі",
  "metaName": "Радченко Станіслав",
  "resume": "Резюме",
  "metaDesc": "Frontend-розробник, зосереджений на складних бізнес-додатках.Я створюю високонавантажені клієнтсько-адміністративні системи, які допомагають бізнесу масштабуватись, а користувачам — працювати без зайвого тертя."
}